/** @file
 Console Redirection Config in SCU advance menu string define.

;******************************************************************************
;* Copyright (c) 2013, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************

*/

#langdef en-US "English"
#langdef fr-FR "Français"

#string STR_BLANK_STRING                #language en-US        " "
                                        #language fr-FR        " "

#string STR_ADVANCED_TITLE              #language en-US        "Advanced"
                                        #language fr-FR        "Advancé"

#string STR_DISABLED_TEXT               #language en-US        "Disabled"
                                        #language fr-FR        "Désactiver"

#string STR_ENABLED_TEXT                #language en-US        "Enabled"
                                        #language fr-FR        "Activer"

#string STR_YES_TEXT                    #language en-US        "Yes"
                                        #language fr-FR        "Oui"

#string STR_NO_TEXT                     #language en-US        "No"
                                        #language fr-FR        "Non"


#string STR_TERMINAL_SETUP_TITLE        #language en-US        "Console Redirection Setup"
                                        #language fr-FR        "Console Redirection Setup"
#string STR_CR_CONSOLE_REDIRECTION      #language en-US        "Console Serial Redirect"

#string STR_CR_CONSOLE_REDIRECTION_HELP #language en-US        "Enable Console Redirection Function"

#string STR_TERMINAL_TITLE              #language en-US        "Console Redirection"
                                        #language fr-FR        "Console Redirection"
#string STR_TERMINAL_TITLE_HELP         #language en-US        "Console Redirection Settings"
                                        #language fr-FR        "Console Redirection Settings"

#string STR_CR_LOGO_WAIT_TIME           #language en-US        "Information Wait Time"
#string STR_CR_LOGO_WAIT_TIME_HELP      #language en-US        "Set Console Redirection port information display time"
#string STR_CR_LOGO_WAIT_0_SECOND       #language en-US        " 0 Second"
#string STR_CR_LOGO_WAIT_2_SECOND       #language en-US        " 2 Second"
#string STR_CR_LOGO_WAIT_5_SECOND       #language en-US        " 5 Second"
#string STR_CR_LOGO_WAIT_10_SECOND      #language en-US        "10 Second"
#string STR_CR_LOGO_WAIT_30_SECOND      #language en-US        "30 Second"
#string STR_CR_LOGO_WAIT_A_KEY          #language en-US        "Wait a Key"
                                        
#string STR_CR_TERMINAL_TYPE            #language en-US        "Terminal Type"
#string STR_CR_TERMINAL_TYPE_HELP       #language en-US        "Set Console Redirection terminal type"
#string STR_CR_TERMINAL_TYPE_VT100      #language en-US        "VT_100"
#string STR_CR_TERMINAL_TYPE_VT100P     #language en-US        "VT_100+"
#string STR_CR_TERMINAL_TYPE_VTUTF8     #language en-US        "VT_UTF8"
#string STR_CR_TERMINAL_TYPE_ANSI       #language en-US        "PC_ANSI"

#string STR_CR_SERIAL_PORT              #language en-US        "Serial Port"
#string STR_CR_SERIAL_PORT_HELP         #language en-US        "Set Console Redirection port"
#string STR_CR_SERIAL_PORTA             #language en-US        "COM_A"
#string STR_CR_SERIAL_PORTB             #language en-US        "COM_B"
#string STR_CR_SERIAL_PORTC             #language en-US        "COM_C"
#string STR_CR_SERIAL_PORTD             #language en-US        "COM_D"
#string STR_CR_PCI_ONLY                 #language en-US        "PCI Device"
#string STR_CR_SERIAL_ALL               #language en-US        "All Device Ports"

#string STR_CR_BAUD_RATE                #language en-US        "Baud Rate"
#string STR_CR_BAUD_RATE_HELP           #language en-US        "Set Console Redirection baud rate"
#string STR_CR_BAUD_RATE_115200         #language en-US        "115200"
#string STR_CR_BAUD_RATE_57600          #language en-US        " 57600"
#string STR_CR_BAUD_RATE_38400          #language en-US        " 38400"
#string STR_CR_BAUD_RATE_19200          #language en-US        " 19200"
#string STR_CR_BAUD_RATE_9600           #language en-US        "  9600"
#string STR_CR_BAUD_RATE_4800           #language en-US        "  4800"
#string STR_CR_BAUD_RATE_2400           #language en-US        "  2400"
#string STR_CR_BAUD_RATE_1200           #language en-US        "  1200"
#string STR_CR_BAUD_RATE_300            #language en-US        "   300"

#string STR_CR_DATA_BIT                 #language en-US        "Data Bits" 
#string STR_CR_DATA_BIT_HELP            #language en-US        "Set Console Redirection data bits"
#string STR_CR_DATA_BIT_7               #language en-US        "7 Bits" 
#string STR_CR_DATA_BIT_8               #language en-US        "8 Bits"

#string STR_CR_STOP_BIT                 #language en-US        "Stop Bits"
#string STR_CR_STOP_BIT_HELP            #language en-US        "Set Console Redirection stop bits"
#string STR_CR_STOP_BIT_1               #language en-US        "1 Bit"
#string STR_CR_STOP_BIT_2               #language en-US        "2 Bits"
 
#string STR_CR_PARITY                   #language en-US        "Parity"
#string STR_CR_PARITY_HELP              #language en-US        "Set Console Redirection parity bits"
#string STR_CR_PARITY_NONE              #language en-US        "None"
#string STR_CR_PARITY_EVEN              #language en-US        "Even" 
#string STR_CR_PARITY_ODD               #language en-US        "Odd"

#string STR_CR_FLOW_CONTROL             #language en-US        "Flow Control"
#string STR_CR_FLOW_CONTROL_HELP        #language en-US        "Set Console Redirection flow control type"/
#string STR_CR_FLOW_CONTROL_NONE        #language en-US        "None"
#string STR_CR_FLOW_CONTROL_HARDWARE    #language en-US        "RTS/CTS"
#string STR_CR_FLOW_CONTROL_SOFTWARE    #language en-US        "XON/XOFF"

#string STR_CR_AFTER_POST               #language en-US        "C.R. After Post"
#string STR_CR_AFTER_POST_HELP          #language en-US        "Console Redirection continue works atfer POST time."

#string STR_CR_TEXT_MODE_RES            #language en-US        "Text Mode Resolution"
#string STR_CR_TEXT_MODE_RES_HELP       #language en-US        "Console Redirection Text Mode Resolution, Auto: Follow VGA text mode; Force 80x25: Don't care VGA, force text mode be 80x25; Force 80x24 (DEL FIRST ROW): Don't care VGA, force text mode be 80x24, Del First Row; Force 80x24 (DEL LAST ROW): Don't care VGA, force text mode be 80x24, Del Last Row"
#string STR_CR_TEXT_MODE_AUTO           #language en-US        "AUTO"
#string STR_CR_TEXT_MODE_80X25          #language en-US        "Force 80x25"
#string STR_CR_TEXT_MODE_80X24_DF       #language en-US        "Force 80x24 (DEL FIRST ROW)"
#string STR_CR_TEXT_MODE_80X24_DL       #language en-US        "Force 80x24 (DEL LAST ROW)"

#string STR_SPCR_SUPPORT_STRING         #language en-US        "ACPI SPCR Table"
#string STR_SPCR_SUPPORT_HELP           #language en-US        "Serial Port Console Redirection Table : Enabled this feature, the SPCR table will be add-into ACPI Tables."


#string STR_CR_DEVICE_TITLE             #language en-US        "ISA Serial Dev"

#string STR_CR_AUTO_REFRESH             #language en-US        "AutoRefresh"
#string STR_CR_AUTO_REFRESH_HELP        #language en-US        "When feature enable, screen will be auto refresh once after detect remote terminal was connected"

#string STR_CR_FAIL_SAFE_BAUDRATE       #language en-US        "FailSafeBaudRate"
#string STR_CR_FAIL_SAFE_BAUDRATE_HELP  #language en-US        "This feature will auto detect remote terminal baud rate and connect C.R serial device with detected baud rate"

#string STR_CR_PORT_ENABLE             #language en-US        "PortEnable"
#string STR_CR_PORT_ENABLE_HELP        #language en-US        " "

#string STR_CR_USE_GLOBAL_SETTING          #language en-US        "UseGlobalSetting"
#string STR_CR_CR_USE_GLOBAL_SETTING_HELP  #language en-US        " "
                                       